[
  "\"If the ride is more fly, you must buy.\"",
  "\"If it's flipping hamburgers at McDonald's, be the best hamburger flipper in the world. Whatever it is you do, you have to master your craft.\"",
  "\"I love making music and I'm falling in love with making records, so it's like having two girlfriends. But I can handle it.\"",
  "\"I just change with the times. I really don't have a say in what's going on. Music was here before me.\"",
  "\"When I'm no longer rapping, I want to open up an ice cream parlor and call myself Scoop Dogg.\"",
  "\"It's so easy for a kid to join a gang, to do drugs...we should make it that easy to be involved in football and academics.\"",
  "\"Well, hip-hop is what makes the world go around.\"",
  "\"You've got to always go back in time if you want to move forward.\"",
  "\"Sometimes a loss is the best thing that can happen. It teaches you what you should have done next time.\"",
  "\"If you stop at general math, you're only going to make general math money.\"",
  "\"I like going to areas where the murder rate is high and dropping it.\"",
  "\"An older guy, he's going to show you things that a young man can't show you. He's going to show you how to stay alive. He's going to show you how to turn corners where your young friends will show you how to turn right into that wall, you know what I'm saying?\"",
  "\"My mind on my money, and my money on my mind.\"",
  "\"Drop it like it's hot.\"",
  "\"There'll be ups and downs, smiles and frowns.\"",
  "\"It ain't no fun if the homies can't have none.\"",
  "\"The more medicated the more dedicated.\"",
  "\"You don't get respect if you don't deserve it.\"",
  "\"Be your own leader, be your own self, step out of my shadows and be your own person.\"",
  "\"With so much drama in the L-B-C, it's kinda hard being Snoop D-O-double-G\"",
  "\"You might not have a car or a big gold chain, stay true to yourself and things will change.\"",
  "\"The fact is, the truth will come out. The truth will come out when it's time.\"",
  "\"Do what you feel is right, baby.\"",
  "\"It's old white ladies, old black ladies, old black men, who don't even listen. Everyone else, everyone who understands, likes Snoop Dogg. They like my music.\"",
  "\"Love goes unappreciated a lot of times, but you still gotta keep giving it.\"",
  "\"Sometimes if you're lucky, someone comes into your life who'll take up a place in your heart that no one else can fill. Someone who's tighter than a twin, more with you than your own shadow, who gets deeper under your skin than your own blood and bones.\"",
  "\"I tell the truth. And I know what I'm talking about. That's why I'm a threat.\"",
  "\"I'm just doing what I do best and that's what makes good music, and that's how you can relate to people.\"",
  "\"There's no such thing as losing touch. You can take me out of the ghetto, but you can't take the ghetto out of me.\"",
  "\"A lot of people like to fool you and say that you're not smart if you never went to college, but common sense rules over everything. That's what I learned from selling crack.\"",
  "\"That's how we do it in the black community; we give back to the people who made us who we are. We never forget that.\"",
  "\"Women are in a position now to voice their opinion...women are getting empowered. The more power they get, the more voice they get to shift certain things around. Now I have a daughter, I understand. When I didn't have a daughter, I didn't understand.\"",
  "\"What I try to push and promote is peace through the whole music industry.\"",
  "\"Life is about growing and evolving. I feel like my life has been in stages, and the stages I went through when I was younger allowed me to grow into the man I am today.\"",
  "\"You can teach an old dog a new trick if that old dog listen.\"",
  "\"To go sit down with people you've got a misunderstanding with is a big step. It shows that you have no hate in your heart, and you really wanna resolve it.\"",
  "\"Yo' what's up? This is Snoop D-O-double-G sayin' stop the violence, drop the guns, and increase the peace.\"",
  "\"What you want dog? I'm on a million-dollar mission.\"",
  "\"The most important decision I've made in business? The choices of people I have around me. When I first started I brought everybody with me, my homies from the neighborhood, criminals. I just said, 'Come on everybody, we made it.' Then I had to realize we didn't make it. I made it.\"",
  "\"That's why I'm so successful because peace is my main thing, it's not about money. It's about making sure everybody is having a good time and loving and living and enjoying life.\"",
  "\"I'm in the game for real; it pays to chill. I walk in the club and they front the bill.\"",
  "\"I want to be loved while I'm here, and the only way to get love is to give love.\"",
  "\"She might be with him, but she's thinkin' 'bout me.\"",
  "\"Snoop Scorsese, that's my director name.\"",
  "\"If there was no Hammer, there would be no Snoop.\"",
  "\"I move with the time. Whatever's happening in time, I'm in.\"",
  "\"My liberty is about living. It's about spreading more love. Even though I was always a peaceful, loving individual, my music sometimes didn't reflect that. But now it's different. My music is reflecting the way I feel.\"",
  "\"There's so much that I want to do. I feel like I'm the Magic Johnson of rap. You know, Magic was great on the basketball court, but he's bigger as a businessman.\"",
  "\"I used to be focused on being the dopest rapper in the game, and then once that became what I was, I wanted something different, and I wanted to become the best business man in the game. I wanted to learn how to master the business like I mastered the rap.\"",
  "\"Now we talkin' stocks and bonds, NFTs and cryptos the money profit crackin', so to the bank a Crip go.\"",
  "\"I think me and Dre are gonna be like Walter Matthau and Jack Lemmon. When we get really old, I'll probably be having gray braids.\"",
  "\"Look at music for what's it's worth around the world and not just America. In other countries, people are still buying CDs and going to record stores. But in America, it's all about digital. The game is breaking down. But, look at me, you need to know how to play the game the right way.\"",
  "\"When I heard the royal family wanted to have me perform in celebration of Prince William's marriage, I knew I had to give them a little something. 'Wet' is the perfect anthem for Prince William or any playa to get the club smokin'.\"",
  "\"I learned how to take other people's mechanisms of promoting their stuff through me as opposed to promoting my own stuff, as far as getting Snoop DeVilles, SnoopDeGrills, Snoop Doggy Dogg biscuits, Snoop Dogg record label, Snoop Dogg bubble gum, Snoop Youth Football League.\"",
  "\"I want to write, direct, produce, but in steps. I want to take steps. I don't want to just jump in because I sold a lot of records and just feel like I can jump into the movie world. Naw, I want to learn the move world like I learned the music world.\"",
  "\"Now people think it's cool to have a baby, but it ain't cool to take care of it. We have to change that. You make your life for that baby. That's the future.\"",
  "\"It's an unexplainable feeling, an expression. It's a touch, it's a feel. Once you feel it, it's like no other thing in the world.\"",
  "\"I wanted to become a better Snoop Dogg, full of water, proteins, and stuff to keep me alive...not lollipops and Big Macs.\"",
  "\"They say I'm greedy, but I still want more, cause my eyes want to journey.\"",
  "\"The more information you have, the better you will be.\"",
  "\"The best advice I ever got is to be yourself. Stay true to who you are and what you stand for and you'll go far in life.\"",
  "\"Reggae is music of love. It has joy and pain, but it feels good.\"",
  "\"I smack up the world if they rude to you 'cause baby girl, you're so beautiful.\"",
  "\"You don't love me, you just love my doggystyle.\"",
  "\"That's all we can be thankful for is the time that we get with people while they're here.\"",
  "\"That's what life is all about, living each day. You only die once so you should live every day.\"",
  "\"Airdrop? The fuck that mean? I'm lookin' in the air for the shit to drop.\""
]